{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "ProtMambaModel",
    "parent_library": "__main__"
  },
  "base_model_name_or_path": "/scratch200/tallilo/deep_learning_project/models/protmamba",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 128,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 64,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value",
    "in_proj",
    "x_proj",
    "out_proj",
    "query",
    "key",
    "fc1",
    "fc2",
    "dt_proj",
    "dense"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}